# Tap
tap "blurfx/tap"
tap "anomalyco/tap"
tap "jesseduffield/lazygit"

# Brew
brew "bat"
brew "zstd"
brew "btop"
brew "chezmoi"
brew "cocoapods"
brew "doggo"
brew "eza"
brew "fd"
brew "gh"
brew "git"
brew "gnupg"
brew "gum"
brew "just"
brew "lazygit"
brew "mas"
brew "mise"
brew "mole"
brew "pango"
brew "pv"
brew "pygments"
brew "sshpass"
brew "starship"
brew "tree"
brew "watchman"
brew "wget"
brew "wireguard-tools"
brew "xorriso"
brew "yq"
brew "zplug"

# Cask
cask "1password"
cask "android-commandlinetools"
cask "android-studio"
cask "balenaetcher"
cask "chatgpt"
cask "claude"
cask "claude-code@latest"
cask "cmux"
cask "codex"
cask "codex-app"
cask "discord"
cask "figma"
cask "font-d2coding"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-cjk-kr"
cask "font-noto-sans-mono-cjk-kr"
cask "font-pretendard"
cask "google-chrome"
cask "google-drive"
cask "hancom-word"
cask "hex-fiend"
cask "httpie-desktop"
cask "karabiner-elements"
cask "league-of-legends"
cask "logi-options+"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "setapp"
cask "slack"
cask "steam"
cask "tailscale-app"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "AladinEbook", id: 1023251042
mas "Channel Talk", id: 1102655071
mas "ColorSlurp", id: 1287239339
mas "CrystalFetch", id: 6454431289
mas "Developer", id: 640199958
mas "ExcalidrawZ", id: 6636493997
mas "FileZilla Pro", id: 1298486723
mas "Keynote", id: 361285480
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 361304891
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 361309726
mas "Raycast Companion", id: 6738274497
mas "Refined GitHub", id: 1519867270
mas "Transporter", id: 1450874784
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "반디집", id: 1265704574
mas "유니콘", id: 1231935892
mas "카카오톡", id: 869223134
mas "카카오톡 (업무)", id: 869223134
