# Tap
tap "blurfx/tap"
tap "jesseduffield/lazygit"

# Brew
brew "bat"
brew "btop"
brew "chezmoi"
brew "doggo"
brew "eza"
brew "gh"
brew "git"
brew "gnupg"
brew "gum"
brew "just"
brew "lazygit"
brew "mas"
brew "mise"
brew "pv"
brew "pygments"
brew "starship"
brew "tree"
brew "wget"
brew "yq"
brew "zplug"

# Cask
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-pro"
cask "android-studio"
cask "claude"
cask "claude-code"
cask "cursor"
cask "datagrip"
cask "discord"
cask "figma"
cask "font-d2coding"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-cjk-kr"
cask "font-noto-sans-mono-cjk-kr"
cask "font-pretendard"
cask "google-chrome"
cask "google-drive"
cask "hancom-word"
cask "hex-fiend"
cask "httpie-desktop"
cask "karabiner-elements"
cask "logi-options+"
cask "notion"
cask "notion-calendar"
cask "orbstack"
cask "raycast"
cask "screen-studio"
cask "setapp"
cask "slack"
cask "utm"
cask "warp"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Channel Talk", id: 1102655071
mas "ColorSlurp", id: 1287239339
mas "CrystalFetch", id: 6454431289
mas "Developer", id: 640199958
mas "FileZilla Pro", id: 1298486723
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Raycast Companion", id: 6738274497
mas "Refined GitHub", id: 1519867270
mas "Transporter", id: 1450874784
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "반디집", id: 1265704574
mas "유니콘", id: 1231935892
mas "카카오톡", id: 869223134
mas "카카오톡 (업무)", id: 869223134

# VSCode
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "anysphere.remote-ssh"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "k--kato.intellij-idea-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"